---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShortCurveTolerance
source: html/0717b79e-efa9-e5ad-baed-999782c0e1e4.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShortCurveTolerance Property

The enforced minimum length for any curve created by Revit.

## Syntax (C#)
```csharp
public double ShortCurveTolerance { get; }
```